testCase/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  splitCyclic                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     7;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 1.0e-04;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.0e-04;
    }

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    up
    {
        type           symmetry;

    }
    down
    {
        type           symmetry;

    }
    cyc_half0
    {
        type            cyclic;
    }
    cyc_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
