testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "0.0001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5684;
        startFace       2926274;
    }
    down
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          5713;
        startFace       2931958;
    }
    inlet
    {
        type            patch;
        nFaces          3103;
        startFace       2937671;
    }
    outlet
    {
        type            patch;
        nFaces          3103;
        startFace       2940774;
    }
    up
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          5713;
        startFace       2943877;
    }
    cyc_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          34162;
        startFace       2949590;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyc_half1;
    }
    cyc_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          34162;
        startFace       2983752;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyc_half0;
    }
)

// ************************************************************************* //
