testCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     8;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes      //time 
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(nuTilda)   Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss LUST unlimitedGrad(U);
    div(phi,nuTilda) Gauss limitedLinear 1;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
   
}

interpolationSchemes    // body center to face center
{
    default         linear;
}

snGradSchemes       //normal to the faces
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}
// this function is to caculate the distant from wall to grid center
// SpalartAllmarasDDES turbulence model
wallDist  
{
    method          meshWave;
    // Optionally correct distance from near-wall cells to the boundary
    correctWalls    true;
}

// ************************************************************************* //
